## =======================================================================
## 컨테이너 자료형 - [4] Dict 타입
##
## - 형식 : {키1: 값, 키2: 값. ..., 키n:값}
##          dict({키1: 값, 키2: 값. ..., 키n:값})
##    
## - dict와 연산자
## ========================================================================
## dict 데이터 생성
## ------------------------------------------------------------------------
## [예시] 6개 과목별 점수를 저장
##       국어 99점, 미술 80점, 음악 100점, 물리 90점, 영어 72점, 수학 81점

jumsuDict1 = {'kor' : 99, 'art' : 80, 'mus' : 100, 'phy' : 90 , 'eng': 72, 'math' : 81}
jumsuDict2 = {'kor' : 99, 'ath' : 70, 'eco' : 100}


print(f"jumsuDict1=> 타입 {type(jumsuDict1)}, 원소 개수 : {len(jumsuDict1)}, 데이터 : {jumsuDict1}")
print(f"jumsuDict2=> 타입 {type(jumsuDict2)}, 원소 개수 : {len(jumsuDict2)}, 데이터 : {jumsuDict2}")


## ==============================================================================================
## 연산자 : (1) 덧셈 : dict + dict : 미지원 기능
## ==============================================================================================
# new_dict = jumsuDict1 + jumsuDict2 ## ==> ERROR 발생

## ==============================================================================================
## 연산자 : (2) 곱셈 : dict *int : 미지원 기능
## ==============================================================================================
# new_dict = jumsuDict1 * 2  ## ==> ERROR 발생

## ==============================================================================================
## 연산자 : (3) 멤버 연산자 : in / not in 
##          ★ 단!! key 만 가능
## ==============================================================================================
## 키 존재 여부 체크
print(f"'eco' in jumsuDict2 : {'eco' in jumsuDict2}")
print(f"'eco' in jumsuDict1 : {'eco' in jumsuDict1}")

## 값 존재 여부 체크 ==> ★ 키만 존재 여부함!!!
print(f"\n99 in jumsuDict2 : {99 in jumsuDict2}")
print(f"99 in jumsuDict1 : {99 in jumsuDict1}")