## =======================================================================
## 컨테이너 자료형 - [4] Dict 타입
##
## - 형식 : {키1: 값, 키2: 값. ..., 키n:값}
##          dict({키1: 값, 키2: 값. ..., 키n:값})
## - 특징 : 키와 값의 묶음으로 데이터 저장
##         키는 unique 해야 하는데 만약, 중복된다면 마지막 값이 저장됨!
##         순서가 없음 !  => 키로 데이터/값을 읽기 /추출/선택 가능하기 떄문
## ========================================================================
## dict 데이터 생성
## ------------------------------------------------------------------------
## [예시] 6개 과목별 점수를 저장
##       국어 99점, 미술 80점, 음악 100점, 물리 90점, 영어 72점, 수학 81점

jumsuDict = {'kor' : 99, 'art' : 80, 'mus' : 100, 'phy' : 90 , 'eng': 72, 'math' : 81}
jumsuDict1 = dict({'kor' : 99, 'art' : 80, 'mus' : 100, 'phy' : 90 , 'eng': 72, 'math' : 81})

print(f"jumsuDict=> 타입 {type(jumsuDict)}, 원소 개수 : {len(jumsuDict)}, 데이터 : {jumsuDict}")
print(f"jumsuDict1=> 타입 {type(jumsuDict1)}, 원소 개수 : {len(jumsuDict1)}, 데이터 : {jumsuDict1}")

## ==============================================================================================
## Dict 자료형의 원소 다루기 => (1) 원소 읽기 : 변수 명[키] --> 값
## ==============================================================================================
print(f"jumsuDict['art'] score : {jumsuDict['art']}")
print(f"jumsuDict['math'] score : {jumsuDict['math']}")

# -> 존재하지 않는 key 입력 시 Error
if "ath" in jumsuDict:
    print(f"jumsuDict['ath'] score : {jumsuDict['ath']}")
else:
    print("체육 키는 존재하지 않습니다.")

## ==============================================================================================
## Dict 자료형의 원소 다루기 => (2) 데이터 변경: 변수 명[키] = 값
## ============================================================================================
## 미술 점수 80 ==> 92점 변경
jumsuDict['art'] = 92
print(jumsuDict)

## ==============================================================================================
## Dict 자료형의 원소 다루기 => (3) 데이터 추가: 변수 명[키] = 값
## ============================================================================================
## 존재하지 않는 키 '체육' 점수를 85점으로 => 새로운 데이터 추가
jumsuDict['ath'] = 85
print(jumsuDict)

## ==============================================================================================
## Dict 자료형의 원소 다루기 => (4) 데이터 삭제 : del 변수명[키]
## ============================================================================================
## 물리 점수 삭제

del (jumsuDict['phy']) ## => del jumsuDict['phy']
print(jumsuDict)