## ============================= ==============
##          DataFrame 행과 열(컬럼) 다루기 
## -------------------------------------------
## * 행 선택
##     -> df변수명.iloc[정수 위치 인덱스]
##     -> df변수명.iloc[라벨 인덱스]
## * 열 선택
##     -> df변수명.[컬럼이름]
##     -> df변수명.컬럼이름      : 단!! 컬럼 이름이 str인 경우
## ===========================================
## -------------------------------------------
## [1] 모듈 로딩
## -------------------------------------------
import pandas as pd 

## -------------------------------------------
## [2] DataFrame 인스턴스 생성
## -------------------------------------------
## 데이터 준비

datas = [ [11,33,55,77], 
          [ 2,22, 4,44] , 
          ['A',10,'B',0] ]

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas)
print(df)

## -------------------------------------------
## [3] DataFrame 인스턴스 속성
## -------------------------------------------
print('- DataFrame 기본 속성들 -')
print(f'* index   : {df.index}')
print(f'* columns : {df.columns}')

## -------------------------------------------
## [4] 열/컬럼 선택
## -------------------------------------------
print("\n --- 컬럼 선택 ---")
print("2번 컬럼 선택", type(df[2]))
print(df[2])

print("\n --- 컬럼 선택 ---")
print("3번 컬럼 선택", type(df[3]))
print(df[3])

## -------------------------------------------
## [5] 행/로우 선택
## -------------------------------------------
print("\n --- 행 선택 ---")
print("2번 행 선택", type(df.iloc[2]))
print(df.iloc[2])





