## ============================================
##          DataFrame 행과 열(컬럼) 다루기 
## -------------------------------------------
## * 여러 행 선택 - (1) 인덱스 리스트
##     -> df변수명.iloc[ [정수 위치 인덱스, ...] ]
##     -> df변수명.iloc[ [라벨 인덱스, ...] ]
## * 여러 열 선택
##     -> df변수명.[ [컬럼이름, ...] ]
## ===========================================
## -------------------------------------------
## [1] 모듈 로딩
## -------------------------------------------
import pandas as pd 

## -------------------------------------------
## [2] DataFrame 인스턴스 생성
## -------------------------------------------
## 데이터 준비

datas = [ [11,33,55,77], 
          [ 2,22, 4,44] , 
          ['A',10,'B',0] ]

## DataFrame 인스턴스 생성
df = pd.DataFrame(datas,
                  index=["1st","2nd","3rd"],
                  columns=['A','B','C','D'])
print(df)

## -------------------------------------------
## [3] DataFrame 인스턴스 속성
## -------------------------------------------
print('- DataFrame 기본 속성들 -')
print(f'* index   : {df.index}')
print(f'* columns : {df.columns}')

## -------------------------------------------
## [4] 열/컬럼 선택
##     df변수명 [컬럼 이름]
##     => 컬럼 이름 지정 시 위치 인덱스 지원 x
##     => 여러 개 컬럼이 반환으로 DataFrame 타입
## -------------------------------------------
print("\n --- 컬럼 선택 ---")
print("A,B,C 컬럼 선택", type(df[['A','B','C']]))
print(df[['A','B','C']])

print("\n --- 컬럼 선택 ---")
print("C 컬럼 선택", type(df[['C']]))
print(df[['C']])

## -------------------------------------------
## [5] 행/로우 선택
##     -> df변수명.iloc[ [정수 위치 인덱스, ...] ]
##     -> df변수명.iloc[ [라벨 인덱스, ...] ]
##     -> 반환값은 DataFrame
## -------------------------------------------
print("\n --- 행 선택 ---")
print("여러 행 선택 - 위치 인덱스", type(df.iloc[[2,0,1]]))     # iloc는 정수일 때만 가능
print(df.iloc[[2,0,1]])

print("\n --- 행 선택 ---")
print("여러 행 선택 - 라벨 인덱스", type(df.loc[['3rd']]))
print(df.loc[['3rd']])






