##=================================================
## 컨테이너 자료형 -[1] 순서 있는 자료형 list
##
## -> 다양한 내장함수 활용
##================================================
## 2. list 생성하기 -> 다양한 데이터
##================================================

datas1 = []
datas2 = [7,9,-3,10,0.002,99.999]
datas3 = ["Abc", "APPle", "anaconda", "zoo"]

## --------------------------------------------
## 내장함수 : sorted(변수명) -> 데이터/요소들을 정렬 후 반환하는 함수
##
## ★ 항상 list로 반환
## --------------------------------------------
print("[오름차순 정렬 : 작은 값 -> 큰 값]")
print(f"sorted(datas1) : {sorted(datas1)}, {datas1}")
print(f"sorted(datas2) : {sorted(datas2)}, {datas2}")
print(f"sorted(datas3) : {sorted(datas3)}, {datas3}")


print("[내림차순 정렬 : 큰 값 -> 작은 값]")
print(f"sorted(datas1) : {sorted(datas1, reverse = True)}, {datas1}")
print(f"sorted(datas2) : {sorted(datas2, reverse = True)}, {datas2}")
print(f"sorted(datas3) : {sorted(datas3, reverse = True)}, {datas3}")

## --------------------------------------------
## 내장함수 : range(시작값, 끝값+1, 간격) -> 데이터 범위 생성 후 반환 함수
##
## ★ 많은 데이터를 생성 시 사용하는 함수
##    -> 데이터 범위 객체/타입 생성
##    -> 데이터 범위 : 시작값 <= ~ < 끝값+1
## 예) 1부터 1000까지 OR 1~1000 ==> [1,2,3,4,5,6,7,8,9, ... , 1000] (불편함)
##                            ==> range(1, 1001) (편리함)
## --------------------------------------------
## 1부터 10까지의 숫자 데이터 저장
## ---------------------------------------------
datas1 = [1,2,3,4,5,6,7,8,9,10]
datas2= range(1,11) # 1<= ~ <11

print(f"datas1 : {datas1}, {len(datas1)}개, {type(datas1)}")
print(f"datas2 : {datas2}, {len(datas2)}개, {type(datas2)}")

## --------------------------------------------
## 1부터 100000000까지의 숫자 데이터 저장
## ---------------------------------------------
# datas1 = [1,2,3,4,5,6,7,8,9,10, ..., 99999999, 100000000] # 불편함
datas2= range(1,100000001) # 1<= ~ <100000001  

print(f"datas2 : {datas2}, {len(datas2)}개, {type(datas2)}")

## --------------------------------------------
## 1부터 30까지의 숫자 중 3의 배수만 데이터 저장
## ---------------------------------------------
datas1 = [3, 6, 9, 12, 15, 18, 21, 24, 27, 30]
datas2= range(3, 31, 3) # 3<= ~ <31, 간격: 3

print(f"datas1 : {datas1}, {len(datas1)}개, {type(datas1)}")
print(f"datas2 : {datas2}, {len(datas2)}개, {type(datas2)}, {list(datas2)}") # range -> list로 변환하여 출력


## --------------------------------------------
## [퀴즈] 50부터 1까지의 범위의 숫자를 출력하세요
## 단, range() 함수를 사용하세요
## ---------------------------------------------
datas3 = range(50,0,-1) # 50<= ~ <0, 간격: -1
print(f"datas3 : {datas3}, {len(datas3)}개, {type(datas3)}, {list(datas3)}") # range -> list로 변환하여 출력