# ==============================================================================
#  32.1 예제 람다 표현식으로 함수 만들기
# ==============================================================================
print((lambda x : x+10)(1))                    

y = 10
print((lambda x: x+y)(1))                      

print(list(map(lambda x: x+10, [1, 2, 3])))      

# ==============================================================================
#  32.2 예제) 람다 표현식과 map, filter, reduce 함수 활용하기
# ==============================================================================

a = list(range(1, 11))
print(list(map(lambda x: str(x) if x%3==0 else float(x) if x%3==1 else x, a)))       

a, b = list(range(1, 6)), list(range(2, 11, 2))
print(list(map(lambda x, y: x*y, a, b)))         

a = [8, 3, 2, 10, 15, 7, 1, 9, 0, 11]            
print(list(filter(lambda x: x>5 and x<10, a)))

from functools import reduce
a = list(range(1, 6))
print(reduce(lambda x, y: x+y, a))               


# ========================================================================================================
#  32.3 퀴즈
# ========================================================================================================
## 1. 다음 중 값 세 개를 매개변수로 받은 뒤 매개변수를 모두 곱해서 반환하는 람다 표현식으로 올바른 것을 고르세요.
# ============================================================================== 
 # a. lambda a, b: a * b                           
 # b. lambda a, b, c: return a * b * c             
 # c. lambda a, b, c -> a * b * c                  
 # d. lambda a, b, c: a * b * c                     
 # e. lambda(a, b, c): a * b * c                  

# 정답 : d

# =========================================================================================================
## 2. 다음 중 람다 표현식 자체를 호출하는 방법으로 올바른 것을 고르세요. 
# ==============================================================================
#  a. lambda a: a + 1(10)                          
#  b. (lambda a: a + 1)(10)                       
#  c. lambda a: a + 1: 10                          
#  d. lambda a: a + 1, 10                         
#  e. lambda a: a + 1 <- 10                       

# 정답 : b

# ============================================================================================================
## 3. 다음 중 리스트 a의 요소 중 7로 끝나는 숫자만 다시 리스트로 만드는 방법으로 올바른 것을 고르세요.
# ==============================================================================
 # a. list(lambda x: x % 10 == 7, a)              
 # b. list(map(lambda x: x % 10 == 7, a))          
 # c. list(filter(lambda x: x % 10 == 7, a))	    
 # d. list(reduce(lambda x: x % 10 == 7, a))		 
 # e. list(filter(lambda x: x % 7 == 0, a))		 

# 정답 : c

# ====================================================================================================
#  32.4 연습문제: 이미지 파일만 가져오기
# ===================================================================================================
files = ['font', '1.png', '10.jpg', '11.gif', '2.jpg', '3.png', 'table.xslx', 'spec.docx']
print(list(filter(lambda file: file[file.find('.')+1:] in ['jpg', 'png'], files)))

# =====================================================================================================
#  32.5 심사문제: 파일 이름을 한꺼번에 바꾸기
# =====================================================================================================
file_list = input("파일 이름을 숫자.확장자의 형식, 공백으로 구분하여 입력해주세요.").strip().split()
print(list(map(lambda file: f"{int(file[:file.find('.')]):0>3d}{file[file.find('.'):]}", file_list)))

# =======================================================================================================
#  33.1 예제: 변수의 사용 범위 알아보기
# =======================================================================================================

x = 10
def foo():
    x = 20
    print(x)		# 20
foo()
print(x)			# 10

x = 10
def foo():
    global x
    x = 20
    print(x)		# 20
print(x)			# 20

def foo():
    x = 10
    print(locals())	# 함수 내의 변수들을 딕셔너리 형태로 반환
foo()
